{
    "intro": {
        "name": "ALEX CHEN",
        "program": "Computing and Financial Management"
    },
    
    "about": {
        "content": "I am currently a 4th-year student in Computing and Financial Management Honours Co-op Program at University of Waterloo. I have worked 5 internships pertaining to application development at DBRS Inc., Ashlin-BPG Marketing Inc., BDO Canada. On the side, I take various online courses in Machine Learing, Full-stack Development, and Artificial Intelligence. I have been also preparing on the CFA exam as I have completed courses in Economics, Financial Accounting, Corportate Finance, Regression and Forecasting, Fixed Income Securities, and Derivatives.",
        "services": [
            {
                "title": "App Development",
                "src": "/assets/img/icons/dev.png"
            },
            {
                "title": "Data Science",
                "src": "/assets/img/icons/icon-big-data-analytics.svg"
            },
            {
                "title": "Financial Technology",
                "src": "/assets/img/icons/fintech.svg"
            }
        ]
    },
    
    "recommendations": [
        {
            "text": "\"Throughout the term Alex worked on couple of critical deliverables with tight deadlines, as well as took part in research of experimental modules for our platform. I had a chance to personally work on the project with Alex during our end of the term hackathon, and was impressed with his ability to research complex systems independently and then work closely with the team to incorporate his findings with overall solution...\"",
            "recBy": "Denys Besedynskyy",
            "position": "AVP of Global Technology, DBRS Inc."
        },
        {
            "text": "\"Alex has been involved in creating a very complex web applications for e-commerce. He is very good at multi-tasking on various projects, and has been a great contributor to our ASHLIN team. His work has been well documented for the next student that will be joining us. The application that he has developed has an excellent user interface. He is always very thorough in creating it, and mindful of the users interaction with the application.\"",
            "recBy": "Juanne E. Kochhar",
            "position": "Vice President, Ashlin-BPG Marketing Inc."
        },
        {
            "text": "\"Alex displayed excellent work ethic, was punctual and well-organized in completed his tasks, and proactively sought feedback and guidance to improve the qualify of his work. He showed willingness to follow instructions and was proactive in taking extra responsibilities to ensure deliverables are met.\"",
            "recBy": "Alex Ng",
            "position": "Manager of Solution Technology, BDO Canada."
        }
    ],
    
    "contacts": [
        {
            "title": "Email",
            "icon": "fa-envelope",
            "href": "mailto:achen831008@gmail.com"
        },
        {
            "title": "Cell",
            "icon": "fa-phone-square",
            "href": "tel:+1(416)-706-0268"
        },
        {
            "title": "Linkedin",
            "icon": "fa-linkedin-square",
            "href": "https://www.linkedin.com/in/achen831008"
        },
        {
            "title": "Github",
            "icon": "fa-github",
            "href": "https://github.com/achen831008"
        },
        {
            "title": "Facebook",
            "icon": "fa-facebook-square",
            "href": "https://www.facebook.com/achen831008.me"
        },
        {
            "title": "Instagram",
            "icon": "fa-instagram",
            "href": "https://www.instagram.com/achen.10.8"
        }
    ],
    
    "portfolio": [   
        {
            "category": "Application",
            "style": "port-category-1",
            "projects": [
                {
                    "title": "Rating Timeline",
                    "type": "Financial Rating Application",
                    "contribution": "DBRS Hack Spring 2016",
                    "keys": ["C# API", "AngularJS", "SQL"],
                    "summary": "Entity Timeline is a project build during the DBRS Data Visualization Hackathon. The purpose of this application is to help visualizing all elements and components such as rating actions, obligations, analysts, and data files associated with the entity. It helps to see all events attached to the rating with a great user interface."
                },
                {
                    "title": "Criteria Committee",
                    "type": "AngularJS Application",
                    "contribution": "DBRS Inc.",
                    "keys": ["C# API", "AngularJS", "SQL"],
                    "summary": "Built a new Angular app with C#.NET API as part of the DBRS rating platform to store all criteria committee meeting minutes and requirements. This new application is to help users having e-meetings and stop the paper work process."
                },
                {
                    "title": "Stateless Rating",
                    "type": "State Machine Application",
                    "contribution": "DBRS Inc.",
                    "keys": ["C#.NET", "Stateless", "SQL"],
                    "summary": "Introduce a standard way to link workflow process with existing entities and ratings. A open-source library, Stateless, is used to help configuring the state machines with permitted states. This workflow service has clear separation with all entities, so there is no dependencies with existing API services."
                },
                {
                    "title": "Finalytics",
                    "type": "Financial Analytics Application",
                    "contribution": "PennApps XIV",
                    "keys": ["Python", "git", "HTML5", "CSS3", "JavaScript", "Bootstrap", "React", "AJAX"],
                    "summary": "Finalytics is an all-in-one dashboard for financial portfolio visualization, analytics, and optimization. The platform assists everyday investors to see live adjustment impacts and quantifiable data from Yahoo Finance, NY Times, and BlackRock Alladin API.",
                    "Awards": ["Best Financial Hack using Alladin API", "Best Data Visualization Hack"]
                },
                {
                    "title": "eCom Manager",
                    "type": "eCommerce Application",
                    "contribution": "Ashlin-BPG Marketing Inc.",
                    "keys": ["C# API", "HTML5", "CSS3", "JavaScript", "jQuery", "SQL", "MS Access"],
                    "summary": "eCom Manager is a Cloud Web Application in C#. It is integrated with various eCommerce APIs and postal service APIs. The Electronic Data Interexchange process is designed by sending HTTP Get/Post Request and stored data in MS Azure. There is various features designed such as analyzing profitability, generating financial report, managing data such as products specification, product design, color code, pricing model, inventory management, and barcode generator."
                }
            ]
        },
        {
            "category": "Data Science",
            "style": "port-category-2",
            "projects": [
                {
                    "title": "TradingML",
                    "type": "Machine Learning",
                    "keys": ["Python", "numpy", "scikit learn"],
                    "summary": "This project is to learn about how Machine Learning can be used to make a recommendation on whether traders shoul buy, hold, or sell the stock given a specific timeframe."
                },
                {
                    "title": "MoneyOptimizer",
                    "type": "Portfolio Optimization",
                    "keys": ["Python", "pandas", "numpy", "scipy"],
                    "summary": "MoneyOptimizer is a project built to optimize a portfolio using maximum sharpe ratio. User will input a date range to select the historical data to use, and select symbols for equities. Assume that the starting value of the portfolio is $1000000, MoneyOptimizer will find the optimal allocations across all stocks with maximum sharpe ratio."
                },
                {
                    "title": "ContentfulSearch",
                    "type": "CMS Search Engine",
                    "contribution": "DBRS Hack Winter 2017",
                    "keys": ["Python", "Contentful API", "Elastic Search", "NodeJS", "S3"],
                    "summary": "Built a syncing pipeline to process data from Contentful (Content Management System) API and S3 bucket to Elastic Search. Then, hook up the search engine with new company site DBRS.COM."
                },
                {
                    "title": "$craper",
                    "type": "Web Scraping",
                    "keys": ["Python", "beautifulsoup", "urllib"],
                    "summary": "$craper is a web scraper that gets all the stock symbols from S&P 500 wikipedia page. Then, it would determine the adjusted closing price of the stocks from the YAHOO Finance page."
                },
                {
                    "title": "AdamCooksEverything",
                    "type": "Data Analytics",
                    "contribution": "AdamCooksEverything YouTube Channel",
                    "keys": ["Python", "Tableau", "TwiterAPI"],
                    "summary": "AdamCooksEverything is a project built for a YouTube Channel 'AdamCooksEverything' hosted by Adam. A Tableau Dashboard is built for him to continuous monitor his social presence on multiple social media platforms. This tool can help him maximizing his social presence on multiple channel, and potential become a better YouTuber."
                }
            ]
        },
        {
            "category": "Finance",
            "style": "port-category-1",
            "projects": [
                {
                    "title": "Rogers Pitch",
                    "type": "Stock Pitch",
                    "keys": ["CAPM", "Forecasting", "Risk Analysis"],
                    "summary": "Prepare a stock pitch by presenting Recommendation (Buy/Hold/Sell), Business and Industry Overview, Competitive Positioning, Revenues Distribution, DCF Mdoel and Forecast, Financial Analysis and Projection, and Investment Risks."
                },
                {
                    "title": "TMX Simulation",
                    "type": "Options Trading Simulation Contest",
                    "keys": ["Black-Scholes", "Investment Strategies", "Derivatives Securities"],
                    "summary": "Managed a portfolio of derivatives securities and generated 15% return over 3 months of period. This project is mainly focusing on understanding Black-Scholes model and different trading strategies such as butterfly spread, straddle, strangle, and hedging."
                },
                {
                    "title": "CAPM Regression",
                    "type": "Statistics in Finance",
                    "keys": ["R", "Thompson Reuter", "Excel"],
                    "summary": "The project is to test the Empirical Validity of the CAPM using SPTSX60 data using Stochastic Time Series Regression and Cross Section Regression. As part of this project, I construct ANOVA table by computing TSS, ESS, RSS and estimating the variance of error term. Lastly, test the existence of autocorrelation of order 1 (AR1) using Durbin-Watson test."
                }
            ]
        }
    ]
}