{
    "educations": [
        {
            "id": 0,
            "school": "University of Waterloo",
            "program": "Bachelor of Computing and Financial Management",
            "link": "https://uwaterloo.ca/",
            "location": "Waterloo, Ontario, Canada",
            "start": "2013",
            "end": "present",
            "summary": [
                "University of Waterloo President's Scholarship",
                "UW Intramural Basketball Champions in Advanced Level"
            ]
        },
        {
            "id": 1,
            "school": "Shawnigan Lake School",
            "program": "Dogwood Diploma",
            "link": "https://www.shawnigan.ca/",
            "location": "Shawnigan Lake, BC, Canada",
            "start": "2008",
            "end": "2013",
            "summary": [
                "Dean's Honour List for all 5 years",
                "Top 1 in AP Calculus AB 12",
                "Top 2 in AP Computer Science 12",
                "BC District Dogwood Scholarship",
                "Mike Little Award Scholarship"
            ]
        }
    ],
    "jobs": [
        {
            "id": 0,
            "organization": "DBRS, Inc.",
            "link": "http://www.dbrs.com",
            "logo": "/assets/img/logo/DBRS_logo.svg",
            "role": "Software Engineering",
            "location": "Toronto, Ontario, Canada",
            "start": "2016",
            "end": "2017",
            "summary": [
                "Followed rapid development process to continuously deliver high-quality low-latency solution to clients",
                "Built high-performance rating search that displays all historical rating and related data in a timeline stream",
                "Limited number of jobs consumed by RabbitMQ to control the resource used by task/notification server",
                "Implemented state machines and entity workflow processes for new rating management tool",
                "Created document generator to process JSON/XML data into various data format for reporting",
                "Set up daily process to sync platform usage data from Intercom to DOMO for data visualization and analysis",
                "Set up a project for Helpdesk and customer success to help 'manage production web services' and 'manage production servers'"
            ]
        },
        {
            "id": 1,
            "organization": "Ashlin-BPG Marketing Inc.",
            "link": "http://www.ashlinbpg.com",
            "logo": "/assets/img/logo/ashlin.png",
            "role": "eCommerce Developer",
            "location": "Mississauga, Ontario, Canada",
            "start": "2015",
            "end": "2015",
            "summary":
            [
                "Developed a data warehouse system with ETL and EDI processes for data analysis and model integration",
                "Implemented a multi-threaded syncing process to import bulk data from various platform and push data to postal services",
                "Managed and provided support for P&L and forecasting analysis on site performance and inventory",
                "Contributed to server and data migration project moving from MS Access to MS Azure",
                "Increased the responsiveness of a core product's user interface, improving the overall user experience"
            ]
        },
        {
            "id": 2,
            "organization": "BDO IT Solutions",
            "link": "http://www.bdo.ca",
            "logo": "/assets/img/logo/BDO_logo.jpg",
            "role": "Solution Consultant",
            "location": "Mississauga, Ontario, Canada",
            "start": "2014",
            "end": "2015",
            "summary":
            [
                "Excellent understanding of Agile software development and Software Development Life Cycle (SDLC)",
                "Interacted with various stakeholders (Project Manager, Delivery Manager, Dev lead) and team members to ensure quality and on-time delivery of project",
                "Developed test plans and test cases of complex nature from business requirement analysis",
                "Captured software defects in the system by using end-to-end, integration, regression, and user acceptance testing approach",
                "Used SQL skill to compare mock-up data with client's real data in Microsoft SQL Server"
            ]
        },
        {
            "id": 3,
            "organization": "Visual Photonic Expitaxy Co., Ltd",
            "link": "http://www.vpec.com.tw",
            "logo": "/assets/img/logo/VPEC_logo.png",
            "role": "Financial Analyst and Developer",
            "location": "Taoyuan County, Taiwan",
            "start": "2014",
            "end": "2014",
            "summary":
            [
                "Designed and implemented a internal web application for User Profile, HR News, Meeting scheduling, Support and IT Maintenance Request",
                "Created and managed SQL relational database, views, and stored procedures for building reporting tools",
                "Created financial transactions including posting general ledgers from invoices to customers, cash receipts, and supplier invoices",
                "Assisted in annual budging and forecasting processes and resolve the discrepancies between source data"
            ]
        }
    ],
    "awards": [
        {
            "id": 0,
            "year": "2016",
            "contest": "PennApps 2016",
            "name": "Best Financial Hack & Best Data Visualization Hack",
            "description": "Build Finalytic at PennApps 2016 won the best financial hack sponsored by BlackRock and best data visualization hack sponsored by Qualtric."
        },
        {
            "id": 1,
            "year": "2016",
            "contest": "DBRS Hack 2016",
            "name": "2nd Place in Data Visualization Hack",
            "description": "Build a project with AngularJS frontend and C# backend during the DBRS Data Visualization Hackathon. "
        },
        {
            "id": 2,
            "year": "2013",
            "contest": "BC Senior High School Tennis Provincials",
            "name": "3rd Place in BC Provincials",
            "description": "Compete..."
        },
        {
            "id": 3,
            "year": "2013",
            "contest": "BC Senior Performing Arts Provincials",
            "name": "Honorable Mention",
            "description": "Compete in ..."
        },
        {
            "id": 4,
            "year": "2012",
            "contest": "Fermat Math Contest",
            "name": "Honorable Mention",
            "description": "Top 2% in Canada out of 15000 participants"
        }
    ],
    "recommendations": [
        {
            "id": 0,
            "year": "2017",
            "position": "Software Engineering",
            "text": "\"Current term was the second term Alex joined out team at DBRS. As with previous term Alex showed high level of professionalism and dependability. Throughout the term he worked on couple of critical deliverables with tight deadlines, as well as took part in research of experimental modules for our platform. I had a chance to personally work on the project with Alex during our end of the term hackathon / workathon, and was impressed with his ability to research complex systems independently and then work closely with the team to incorporate his findings with overall solution. He takes all the feedback he can get from our senior engineers and uses it to improve his technical skills, which tells me that he will be successful in any position in his future career.\"",
            "recommender": "Denys Besedynskyy",
            "recommenderPosition": "AVP of Global Technology, DBRS Inc."
        },
        {
            "id": 1,
            "year": "2016",
            "position": "eCommerce Developer",
            "text": "\"Alex has been involved in creating a very complex web applications for e-commerce. He is very good at multi-tasking on various projects, and has been a great contributor to our ASHLIN team. His work has been well documented for the next student that will be joining us. The application that he has developed has an excellent user interface. He is always very thorough in creating it, and mindful of the users interaction with the application.\"",
            "recommender": "Juanne E. Kochhar",
            "recommenderPosition": "VP of Ashlin-BPG Marketing Inc."
        },
        {
            "id": 2,
            "year": "2015",
            "position": "Solution Consultant",
            "text": "\"Alex displayed excellent work ethic, was punctual and well-organized in completed his tasks, and proactively sought feedback and guidance to improve the qualify of his work. He showed willingness to follow instructions and was proactive in taking extra responsibilities to ensure deliverables are met.\"",
            "recommender": "Alex Ng",
            "recommenderPosition": "Manager of Solution Technology, BDO Canada."
        }
    ]
}
