{
    "organization": "Ashlin-BPG Marketing Inc.",
    "logo": "/assets/img/logo/ashlin.png",
    "role": "eCommerce Developer",
    "location": "Mississauga, Ontario, Canada",
    "start": "2015-09-07",
    "end": "2015-12-18",
    "status": "Complete",
    "industry": "e-Commerce",
    "organizationDescription": "Ashlin BPG Marketing, Inc. was founded in 1989 in Oakville, Ontario, Canada. The “ASHLIN” brand was introduced during 1990 and has continued to be synonymous with exclusivity and the undeterred pursuit of excellence in leather. We are dedicated to continually improve our products and responding to your needs and requirements. Ashlin products are created with durability and classic styling.",
    "summary":
    [
        "Developed a data warehouse system with ETL and EDI processes for data analysis and model integration",
        "Implemented a multi-threaded syncing process to import bulk data from various platform and push data to postal services",
        "Managed and provided support for P&L and forecasting analysis on site performance and inventory",
        "Contributed to server and data migration project moving from MS Access to MS Azure",
        "Increased the responsiveness of a core product's user interface, improving the overall user experience"
    ],
    "projects":
    [
        {
            "name": "Credential Manager",
            "language": ["C# WinForm", "MS Azure", "SQL"],
            "summary": "This application is designed for storing various eCommerce credentials. User is able to see his or her own credentials stored under company; moreover, certain permission is assigned to each user based on his or her authority. Also, Administrator can see the hierarchy relationship of users in the dashboard."
        },
        {
            "name": "Order Manager",
            "language": ["C# API", "HTML5", "CSS3", "JavaScript", "jQuery", "SQL"],
            "summary": "Order Manager is a Cloud Web Application in C#. It is integrated with various eCommerce APIs and postal service APIs. The Electronic Data Interexchange process is designed by sending HTTP Get/Post Request and stored data in MS Azure. There is various features designed such as analyzing profitability and top selling items, generating financial report, order dashboard."
        },
        {
            "name": "SKU Manager",
            "language": ["VBA", "Access", "SQL"],
            "summary": "SKU Manager is a tool built for managing data such as products specification, product design, color code, pricing model, inventory management, and barcode generator."
        }
    ],
    "recommendation": "Alex has been involved in creating a very complex web applications for e-commerce. He is very good at multi-tasking on various projects, and has been a great contributor to our ASHLIN team. His work has been well documented for the next student that will be joining us. The application that he has developed has an excellent user interface. He is always very thorough in creating it, and mindful of the users interaction with the application.",
    "recommendedRole": "Vice President",
    "recommendedBy": "Juanne E. Kochhar"
}
