{
    "organization": "DBRS Limited",
    "logo": "/assets/img/logo/DBRS_logo.svg",
    "role": "Software Engineering",
    "location": "Toronto, Ontario, Canada",
    "start": "2016-05-09",
    "end": "2017-04-28",
    "status": "In Progress",
    "industry": "Credit Rating",
    "organizationDescription": "DBRS is an independent, privately held, globally recognized credit ratings agency with offices in Toronto, New York, London, Chicago and Mexico City. We strive to differentiate ourselves from competitors through a more pragmatic rather than mechanistic approach, in-depth research and unequalled mandate execution. Our approach and our size as the world's fourth-largest ratings agency allow us to be nimble enough to respond to customers' needs in their local markets, but large enough to provide the necessary expertise and resources they require. We build meaningful relations, which contribute to a convincing value proposition for investors and issuers to choose us a globally accepted alternative to other ratings agencies.",
    "summary":
    [
        "Followed rapid development process to continuously deliver high-quality low-latency solution to clients",
        "Built high-performance rating search that displays all historical rating and related data in a timeline stream",
        "Limited number of jobs consumed by RabbitMQ to control the resource used by task/notification server",
        "Set up daily process to sync platform usage data from Intercom to DOMO for data visualization and analysis",
        "Set up a project for Helpdesk and customer success to help 'manage production web services' and 'manage production servers'",
        "Implement state machines and workflow processes using factory design pattern in fluent API"
    ],
    "projects": [],
    "techstack": ["C#", "MVC.NET", "Entity Framework", "Linq", "ORM", "HTML", "CSS", "Bootstrap", "TypeScriptJS", "UnderscoreJS", "AngularJS", "JavaScript", "T-SQL", "MongoDB", "Git", "PowerShell"],
    "recommendation": "As part of software engineering team Alex shown good teamwork and collaboration skills. We at DBRS set high expectations for our coops, as they become truly part of our team and work on the same assignments as our full time employees would. Alex proved himself as a quick learner, and was able to meet all our expectations. Alex participated in our internal Hackathon and showed himself as a reliable team member that can be extremely productive under pressure of short deadline.",
    "recommendedRole": "Assisnt Vice President, Software Engineer",
    "recommendedBy": "Denys Besedynskyy"
}
