{
    "organization": "Visual Photonic Expitaxy Co., Ltd",
    "logo": "/assets/img/logo/VPEC_logo.jpg",
    "role": "Financial Analyst and Developer",
    "location": "Taoyuan County, Taiwan",
    "start": "2014-05-05",
    "end": "2014-08-29",
    "status": "Complete",
    "industry": "Technology",
    "organizationDescription": "Visual Photonics Epitaxy Co., Ltd was founded on November 26th, 1996 by an excellent group of enterprising members. This energetic new company comprised of specialists in optoelectronics, electronic engineering, chemistry, and material science, all with industrial experience and theoretical knowledge in the III-V compound semiconductor field. These technical experts produce HBT, PHEMT, PIN Diode and solar cell epi wafer using MOCVD (Metal Organic Vapor Phase Epitaxy) technology. VPEC is capable of providing the total solution for wireless communications, optical fiber communications and solar cell applications.",
    "summary":
    [
        "Designed and implemented a internal web application for User Profile, HR News, Meeting scheduling, Support and IT Maintenance Request",
        "Created and managed SQL relational database, views, and stored procedures for building reporting tools",
        "Created financial transactions including posting general ledgers from invoices to customers, cash receipts, and supplier invoices",
        "Assisted in annual budging and forecasting processes and resolve the discrepancies between source data"
    ],
    "projects":
    [
        {
            "name": "VPEC Intranet",
            "tools": "IIS, Oracle Database, SQL Server, Notepad++",
            "language": ["HTML5", "CSS3", "JavaScript", "jQuery", "ASP", "MySQL", "IIS"],
            "summary": "VPEC Intranet is designed to improve organizational communication, internal service and management. There are various features implemented such as HR News Feed, IT News Feed, IT Service Request, Meeting Booking Request, and User Support."
        }
    ],
    "recommendation": "Alex is a very positive and polite working partner. He was able to complete his work and project ahead of deadline. Also, his humble learning attitude and independency are what make him outstanding.",
    "recommendedRole": "Manager, Engineering Department",
    "recommendedBy": "Alex Chuang"
}
