{
    "organization": "DBRS Limited",
    "logo": "/assets/img/logo/DBRS_logo.svg",
    "role": "Software Engineering",
    "location": "Toronto, Ontario, Canada",
    "start": "2016-05-09",
    "end": "2017-04-28",
    "status": "In Progress",
    "industry": "Credit Rating",
    "organizationDescription": "DBRS is an independent, privately held, globally recognized credit ratings agency with offices in Toronto, New York, London, Chicago and Mexico City. We strive to differentiate ourselves from competitors through a more pragmatic rather than mechanistic approach, in-depth research and unequalled mandate execution. Our approach and our size as the world's fourth-largest ratings agency allow us to be nimble enough to respond to customers' needs in their local markets, but large enough to provide the necessary expertise and resources they require. We build meaningful relations, which contribute to a convincing value proposition for investors and issuers to choose us a globally accepted alternative to other ratings agencies.",
    "summary":
    [
        "Followed rapid development process to continuously deliver high-quality low-latency solution to clients",
        "Built high-performance rating search that displays all historical rating and related data in a timeline stream",
        "Limited number of jobs consumed by RabbitMQ to control the resource used by task/notification server",
        "Implemented state machines and entity workflow processes for new rating management tool",
        "Created document generator to process JSON/XML data into various data format for reporting",
        "Set up daily process to sync platform usage data from Intercom to DOMO for data visualization and analysis",
        "Set up a project for Helpdesk and customer success to help 'manage production web services' and 'manage production servers'"
    ],
    "projects":
    [
        {
            "name": "Entity Timeline",
            "language": ["C# API", "AngularJS", "SQL"],
            "summary": "Entity Timeline is a project build during the DBRS Data Visualization Hackathon. The purpose of this application is to help visualizing all elements and components such as rating actions, obligations, analysts, and data files associated with the entity. It helps to see all events attached to the rating with a great user interface."
        },
        {
            "name": "Document Generator",
            "language": ["C#.NET", "AngularJS", "OpenXML", "LibreOffice", "XML", "JSON"],
            "summary": "This project is to standardize the way the rating platform generate documents. The process takes a JSON object or an entity object as input, and then generate desired document based on the XML mapping template and document type."
        },
        {
            "name": "CMS Syncing Pipeline",
            "language": ["Python", "Contentful", "Elastic Search", "NodeJS"],
            "summary": "Built a syncing pipeline to process data from Contentful (Content Management System) API to Elastic Search. Then, hook up the search engine with the new company site."
        },
		{
            "name": "Entity State Machine Workflow",
            "language": ["C#.NET", "Stateless", "SQL"],
            "summary": "Introduce a standard way to link workflow process with existing entities. A open-source library, Stateless, is used to help configuring the state machines with permitted states. This workflow service has clear separation with all entities, so there is no dependencies with existing API services."
        },
        {
            "name": "Criteria Committee",
            "language": ["C# API", "AngularJS", "SQL"],
            "summary": "Built a new Angular app with C#.NET API as part of the DBRS rating platform to store all criteria committee meeting minutes and requirements. This new application is to help users having e-meetings and stop the paper work process."
        },
        {
            "name": "Intercom-DOMO Syncing Pipeline",
            "language": ["C# Console App", "SQL"],
            "summary": "The purpose of this project is to sync all DBRS rating platform usage data from Intercom (third party tool) to internal database on a daily basis. Moreover, setup DOMO to visualize data in various charts and reports by pushing the data set from SQL."
        },
        {
            "name": "Emergency Switch",
            "language": ["PowerShell", "TeamCity"],
            "summary": "This project is to help the helpdesk and customer support team handling emergency issues with DBRS rating platform by configuring a project in TeamCity for managing production web services and servers. A documentation is provided with proper instructions and steps on how to proceed the task."
        },
        {
            "name": "RabbitMQ Jobs Limitation",
            "language": ["C#", "RabbitMQ"],
            "summary": "This project is to limit amount of jobs picked up by the workers in the queue, so the worker does not pick up everything in the queue and process it all at once."
        }
    ],
    "recommendation": "As part of software engineering team Alex shown good teamwork and collaboration skills. We at DBRS set high expectations for our coops, as they become truly part of our team and work on the same assignments as our full time employees would. Alex proved himself as a quick learner, and was able to meet all our expectations. Alex participated in our internal Hackathon and showed himself as a reliable team member that can be extremely productive under pressure of short deadline.",
    "recommendedRole": "Assisnt Vice President, Software Engineer",
    "recommendedBy": "Denys Besedynskyy"
}
