{
    "educations": [
        {
            "id": 0,
            "school": "University of Waterloo",
            "program": "Bachelor of Computing and Financial Management, Honours Co-op Program",
            "class": "Class of 2018",
            "link": "https://uwaterloo.ca/computing-financial-management/",
            "location": "Waterloo, Ontario, Canada"
        }
    ],
    "skills": [
        {
            "group": "Languages",
            "list": [
                "Python",
                "C#",
                "JavaScript",
                "C++",
                "Java",
                "SQL"
            ]
        },
        {
            "group": "Web Development",
            "list": [
                "AngularJS",
                "Node.js",
                "Flask",
                "MVC.NET",
                "Entity Framework",
                "MS Azure",
                "AWS",
                "RabbitMQ",
                "MongoDB",
                "Git"
            ]
        },
        {
            "group": "Data Science",
            "list": [
                "Scikit-learn",
                "Pandas",
                "NumPy",
                "SciPy",
                "Matplotlib",
                "Tableau",
                "R"
            ]
        },
        {
            "group": "Design",
            "list": [
                "Sketch",
                "Invision",
                "Adobe Photoshop",
                "Moqups"
            ]
        }
    ],
    "awards": [
        {
            "id": 0,
            "year": "2016",
            "contest": "PennApps 2016",
            "name": "Best Financial Hack & Best Data Visualization Hack",
            "description": "Build Finalytic at PennApps 2016 won the best financial hack sponsored by BlackRock and best data visualization hack sponsored by Qualtric."
        },
        {
            "id": 1,
            "year": "2016",
            "contest": "DBRS Hack 2016",
            "name": "2nd Place in Data Visualization Hack",
            "description": "Build a project to display entity related data in a timeline UI design. This project is implemented with an AngularJS frontend and C# API during the DBRS Data Visualization Hackathon."
        },
        {
            "id": 2,
            "year": "2013",
            "contest": "BC Senior High School Tennis Provincials 2013",
            "name": "3rd Place in BC Provincials",
            "description": "Represent Shawnigan Lake High Schoool to BC Tennis Provincials and get 3rd place out of top 12 selected school across BC."
        },
        {
            "id": 3,
            "year": "2013",
            "contest": "BC Senior Performing Arts Provincials 2013",
            "name": "Honorable Mention",
            "description": "Represent Cowichan Valley District to BC Performing Arts Provincials and get honorable mention in Senior Violin category."
        },
        {
            "id": 4,
            "year": "2012",
            "contest": "Fermat Math Contest 2012",
            "name": "Honorable Mention",
            "description": "Top 2% in Canada out of 15000 participants."
        }
    ],
    "jobs": [
        {
            "id": 0,
            "organization": "DBRS, Inc.",
            "link": "http://www.dbrs.com",
            "logo": "/assets/img/logo/DBRS_logo.svg",
            "role": "Software Engineering",
            "location": "Toronto, Ontario, Canada",
            "start": "May 2016",
            "end": "Apr. 2017",
            "summary": [
                "Created high-performance tools with AngularJS, C#, RabbitMQ, and MongoDB that allowed 1k+ analysts to accelerate process of financial rating",
                "Built a ETL pipeline in Python to extract data from Contentful API and Amazon S3 to Elasticsearch used by DBRS.com search engine in Node.js",
                "Developed document generation service in C# that converted entity objects in JSON/XML to various reporting documents"
            ]
        },
        {
            "id": 1,
            "organization": "Ashlin-BPG Marketing Inc.",
            "link": "http://www.ashlinbpg.com",
            "logo": "/assets/img/logo/ashlin.png",
            "role": "E-Commerce Developer",
            "location": "Mississauga, Ontario, Canada",
            "start": "Sep. 2015",
            "end": "Dec. 2015",
            "summary":
            [
                "Built a multi-threaded syncing process in C# that centralized orders from ecommerce platforms and reduced order processing time",
                "Architected a C#.NET desktop application for ecommerce team to manage product design and specification, SKU code, and barcode generations",
                "Migrated existing server and data to MS Azure allowing business expansion overseas"
            ]
        },
        {
            "id": 2,
            "organization": "BDO Canada",
            "link": "http://www.bdo.ca",
            "logo": "/assets/img/logo/BDO_logo.jpg",
            "role": "Solution Consultant",
            "location": "Mississauga, Ontario, Canada",
            "start": "Jan. 2015",
            "end": "Apr. 2015",
            "summary":
            [
                "Interacted with various stakeholders and engineers to ensure software quality, performance, and on-time delivery of project",
                "Implemented SQL store proc that resolved the discrepancies between mock-up data with client's real data to ensure reliability of data for QAs"
            ]
        },
        {
            "id": 3,
            "organization": "Visual Photonic Expitaxy Co., Ltd",
            "link": "http://www.vpec.com.tw",
            "logo": "/assets/img/logo/VPEC_logo.png",
            "role": "Software Developer",
            "location": "Taoyuan County, Taiwan",
            "start": "May 2014",
            "end": "Aug. 2014",
            "summary":
            [
                "Created an Intranet application with JavaScript, Bootstrap, and ASP.NET used by 300+ employees to publish internal news, schedule meeting, and request IT maintenance",
                "Assisted in building predictive model in Python to forecast company’s wafer sales based on historical data and market demand with an accuracy of 90%"
            ]
        }
    ],
    "projects": [
        {
            "name": "Finalytics",
            "description": "Built an application with Flask to visualize and analyze equity data from Yahoo Finance and BlackRock Aladdin API on a dashboard and optimize portfolios using SciPy",
            "link": "https://devpost.com/software/finalytics"
        },
        {
            "name": "Supervised Breast Cancer Model",
            "description": "Trained supervised model with University of Wisconsin Hospitals dataset using SciKit-learn, NumPy, and Pandas to diagnose patients with breast cancer with 97.5% accuracy",
            "link": "https://github.com/achen831008/Breast-Cancer-Prediction"
        },
        {
            "name": "TMX Options Trading Simulation",
            "description": "Generated 15% return on a portfolio of derivatives securities over 3 months of timespan by applying Black-Scholes model and trading strategies such as butterfly spread, straddle, strangle, and hedging",
            "link": "#"
        }
    ],
    "recommendations": [
        {
            "id": 0,
            "year": "2017",
            "position": "Software Engineering",
            "text": "\"Current term was the second term Alex joined out team at DBRS. As with previous term Alex showed high level of professionalism and dependability. Throughout the term he worked on couple of critical deliverables with tight deadlines, as well as took part in research of experimental modules for our platform. I had a chance to personally work on the project with Alex during our end of the term hackathon / workathon, and was impressed with his ability to research complex systems independently and then work closely with the team to incorporate his findings with overall solution. He takes all the feedback he can get from our senior engineers and uses it to improve his technical skills, which tells me that he will be successful in any position in his future career.\"",
            "recommender": "Denys Besedynskyy",
            "recommenderPosition": "AVP of Global Technology, DBRS Inc."
        },
        {
            "id": 1,
            "year": "2016",
            "position": "eCommerce Developer",
            "text": "\"Alex has been involved in creating a very complex web applications for e-commerce. He is very good at multi-tasking on various projects, and has been a great contributor to our ASHLIN team. His work has been well documented for the next student that will be joining us. The application that he has developed has an excellent user interface. He is always very thorough in creating it, and mindful of the users interaction with the application.\"",
            "recommender": "Juanne E. Kochhar",
            "recommenderPosition": "VP of Ashlin-BPG Marketing Inc."
        },
        {
            "id": 2,
            "year": "2015",
            "position": "Solution Consultant",
            "text": "\"Alex displayed excellent work ethic, was punctual and well-organized in completed his tasks, and proactively sought feedback and guidance to improve the qualify of his work. He showed willingness to follow instructions and was proactive in taking extra responsibilities to ensure deliverables are met.\"",
            "recommender": "Alex Ng",
            "recommenderPosition": "Manager of Solution Technology, BDO Canada."
        },
        {
            "id": 3,
            "year": "2014",
            "position": "Software Developer",
            "text": "\"Alex is a very positive and polite employee. He was able to participate and complete projects with high quality of code. Alex displayed his strong learning skills, as he was able to quickly pick up a new language and contribute to the team.\"",
            "recommender": "Alex Chuang",
            "recommenderPosition": "Manager of Software Engineering."
        }
    ]
}
